'''
돈 = 3000
음료수캔 = 0
while 돈 > 700:
    print("음료수 = {}개, 잔돈 {}원".format(음료수캔,돈))
    음료수캔 +=1
    돈 -=700

print("음료수 = {}개, 잔돈 {}원".format(음료수캔,돈))
'''


def 자판기(금액):
    몇번 = 금액//700
    몇잔 = 0
    for i in range(몇번):
        print ("음료수 = {}개, 잔돈 {}원".format(몇잔,금액))
        몇잔 +=1
        금액 -=700
    print ("음료수 = {}개, 잔돈 {}원".format(몇잔,금액))


자판기(3000)

def 절댓값더하기(숫자1,숫자2):
    if 숫자1 < 0 and 숫자2 >= 0: 
       return 숫자1*(-1) + 숫자2
    if 숫자1 >=0 and 숫자2 <0:
        return 숫자1 + 숫자2*(-1)
    if 숫자1 <0 and 숫자2 <0:
        return 숫자1*(-1) + 숫자2*(-1) 
    else:
        return 숫자1 + 숫자2

   
print(절댓값더하기(3,-1))
print(절댓값더하기(5,2))
print(절댓값더하기(-3,2))


    
        
    
